{"total_platforms":20,"total_free_casts":271,"platforms":[{"name":"nodejs","title":"Node.js","url":"http://devfreecasts.org/nodejs","about":"Node.js is a platform built on Chrome's JavaScript runtime for easily building fast, scalable network applications. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient, perfect for data-intensive real-time applications that run across distributed devices.","category":"languages","image":"http://devfreecasts.org/assets/images/nodejs.jpg","total_videos":27},{"name":"meteor","title":"Meteor","url":"http://devfreecasts.org/meteor","about":"Meteor is an open-source platform for building top-quality web apps in a fraction of the time, whether you're an expert developer or just getting started.","category":"frameworks","image":"http://devfreecasts.org/assets/images/meteor.jpg","total_videos":23},{"name":"angularjs","title":"AngularJS","url":"http://devfreecasts.org/angularjs","about":"AngularJS is a toolset for building the framework most suited to your application development. It is fully extensible and works well with other libraries. Every feature can be modified or replaced to suit your unique development workflow and feature needs.","category":"frameworks","image":"http://devfreecasts.org/assets/images/angularjs.jpg","total_videos":18},{"name":"react","title":"React","url":"http://devfreecasts.org/react","about":"A JavaScript library for building User Interfaces. Lots of people use React as the V in MVC. Since React makes no assumptions about the rest of your technology stack, it's easy to try it out on a small feature in an existing project.","category":"frameworks","image":"http://devfreecasts.org/assets/images/react.jpg","total_videos":14},{"name":"backbone","title":"Backbone","url":"http://devfreecasts.org/backbone","about":"Backbone.js gives structure to web applications by providing models with key-value binding and custom events, collections with a rich API of enumerable functions, views with declarative event handling, and connects it all to your existing API over a RESTful JSON interface.","category":"frameworks","image":"http://devfreecasts.org/assets/images/backbone.jpg","total_videos":4},{"name":"javascript","title":"JavaScript","url":"http://devfreecasts.org/javascript","about":"JavaScript is a lightweight, interpreted, object-oriented language with first-class functions, most known as the scripting language for Web pages, but used in many non-browser environments as well such as Node.js or Apache CouchDB. It is a prototype-based, multi-paradigm scripting language that is dynamic, and supports object-oriented, imperative, and functional programming styles.","category":"languages","image":"http://devfreecasts.org/assets/images/javascript.jpg","total_videos":20},{"name":"rails","title":"Ruby On Rails","url":"http://devfreecasts.org/rails","about":"Ruby On Rails is an open-source web framework that's optimized for programmers happiness and sustainable productivity. It lets you write beautiful code by favoring convention over configuration.","category":"frameworks","image":"http://devfreecasts.org/assets/images/rails.jpg","total_videos":25},{"name":"ruby","title":"Ruby","url":"http://devfreecasts.org/ruby","about":"Ruby is a dynamic, open source programming language with a focus on simplicity and productivity. It has an elegant syntax that is natural to read and easy to write.","category":"languages","image":"http://devfreecasts.org/assets/images/ruby.jpg","total_videos":14},{"name":"go","title":"Go","url":"http://devfreecasts.org/go","about":"Go is an open source programming language that makes it easy to build simple, reliable, and efficient software.","category":"languages","image":"http://devfreecasts.org/assets/images/go.jpg","total_videos":19},{"name":"grunt","title":"Grunt","url":"http://devfreecasts.org/grunt","about":"Grunt is a task runner, with huge ecosystem of literally hundreds of plugins to choose it, you can use Grunt to automate just about anything with a minimum of effort. If someone hasn't already built what you need, authoring and publishing your own Grunt plugin to npm is a breeze.","category":"frameworks","image":"http://devfreecasts.org/assets/images/grunt.jpg","total_videos":5},{"name":"elixir","title":"Elixir","url":"http://devfreecasts.org/elixir","about":"Elixir is a functional, meta-programming aware language built on top of the Erlang VM. It is a dynamic language that focuses on tooling to leverage Erlang's abilities to build concurrent, distributed and fault-tolerant applications with hot code upgrades.","category":"languages","image":"http://devfreecasts.org/assets/images/elixir.jpg","total_videos":10},{"name":"scala","title":"Scala","url":"http://devfreecasts.org/scala","about":"Scala is an acronym for “Scalable Language”. This means that Scala grows with you. You can play with it by typing one-line expressions and observing the results. But you can also rely on it for large mission critical systems, as many companies, including Twitter, LinkedIn, or Intel do. To some, Scala feels like a scripting language. Its syntax is concise and low ceremony; its types get out of the way because the compiler can infer them. There’s a REPL and IDE worksheets for quick feedback.","category":"languages","image":"http://devfreecasts.org/assets/images/scala.jpg","total_videos":6},{"name":"python","title":"Python","url":"http://devfreecasts.org/python","about":"Python is a programming language that lets you work more quickly and integrate your systems more effectively. Python is powerful and fast, plays well with others, runs everywhere, is friendly and easy to learn.","category":"languages","image":"http://devfreecasts.org/assets/images/python.jpg","total_videos":15},{"name":"grails","title":"Grails","url":"http://devfreecasts.org/grails","about":"Grails is an Open Source, full stack, web application framework for the JVM. It takes advantage of the Groovy programming language and convention over configuration to provide a productive and stream-lined development experience.","category":"frameworks","image":"http://devfreecasts.org/assets/images/grails.jpg","total_videos":3},{"name":"php","title":"PHP","url":"http://devfreecasts.org/php","about":"PHP is a popular general-purpose scripting language that is especially suited to web development. Fast, flexible and pragmatic, PHP powers everything from your blog to the most popular websites in the world.","category":"languages","image":"http://devfreecasts.org/assets/images/php.jpg","total_videos":12},{"name":"ios","title":"iOS","url":"http://devfreecasts.org/ios","about":"iOS is the world’s most advanced mobile operating system, continually redefining what people can do with a mobile device. Together, the iOS SDK and Xcode IDE make it easy for developers to create revolutionary mobile apps.","category":"languages","image":"http://devfreecasts.org/assets/images/ios.jpg","total_videos":22},{"name":"android","title":"Android","url":"http://devfreecasts.org/android","about":"Android runs on hundreds of millions of handheld devices around the world, and it now supports these exciting, new form-factors.","category":"languages","image":"http://devfreecasts.org/assets/images/android.jpg","total_videos":6},{"name":"java","title":"Java","url":"http://devfreecasts.org/java","about":"Java is the foundation for virtually every type of networked application and is the global standard for developing and delivering embedded applications, games, Web content, and enterprise software. With more than 9 million developers worldwide, Java enables you to efficiently develop and deploy exciting applications and services.","category":"languages","image":"http://devfreecasts.org/assets/images/java.jpg","total_videos":9},{"name":"vim","title":"Vim","url":"http://devfreecasts.org/vim","about":"Vim is a highly configurable text editor built to enable efficient text editing. It is an improved version of the vi editor distributed with most UNIX systems.","category":"devtools","image":"http://devfreecasts.org/assets/images/vim.jpg","total_videos":13},{"name":"chrome-devtools","title":"Chrome DevTools","url":"http://devfreecasts.org/chrome-devtools","about":"The Chrome Developer Tools (DevTools for short), are a set web authoring and debugging tools built into Google Chrome. The DevTools provide web developers deep access into the internals of the browser and their web application. Use the DevTools to efficiently track down layout issues, set JavaScript breakpoints, and get insights for code optimization.","category":"devtools","image":"http://devfreecasts.org/assets/images/chrome-devtools.jpg","total_videos":6}]}